src/Reports/ИС_WB_ЛиквидностьТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ИС_WB_ЛиквидностьТоваровНаСкладах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/Reports/ИС_WB_ЛиквидностьТоваровНаСкладах/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

//+ ИнфоСофт Сумин Д.В. 20.07.23 УА #60317
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ВызватьИсключение("Необходимо выбрать профиль.");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаНачала) Или Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ВызватьИсключение("Необходимо выбрать период загрузки данных.");
	КонецЕсли;
	
	//+ ИнфоСофт Ивонин К.А. 27.01.25 УА #89159
	//НастройкиСоединения = ИС_WB_СерверПовтИсп.ПолучитьНастройкиСоединения(Профиль);
	//
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ИС_WB_Сервер.ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаСтатистики(ПараметрыЗапроса, НастройкиСоединения);
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Статистика");
	//- ИнфоСофт Ивонин К.А. 27.01.25 УА #89159
	
	ПродажиМассив = ИС_WB_API.ПолучитьОтчетОПродажахПоРеализации(Профиль, ПараметрыЗапроса, ДатаНачала, ДатаОкончания);
	
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99469	
	//Продажи = Новый ТаблицаЗначений;            
	ДанныеПродажи = Новый ТаблицаЗначений;            
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99469
	
	КвалификаторыСтроки = Новый КвалификаторыСтроки(300);
	КвалификаторЧисла = Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный);
	
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99469	
	//Продажи.Колонки.Добавить("Склад", Новый ОписаниеТипов("Строка",, КвалификаторыСтроки));
	//Продажи.Колонки.Добавить("НаСкладе", Новый ОписаниеТипов("Число",, КвалификаторЧисла));
	ДанныеПродажи.Колонки.Добавить("Склад", Новый ОписаниеТипов("Строка",, КвалификаторыСтроки));
	ДанныеПродажи.Колонки.Добавить("НаСкладе", Новый ОписаниеТипов("Число",, КвалификаторЧисла));
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99469
	
	//+ ИнфоСофт Украинцева А.А. 16.11.2023 УА #65797
	Если ПродажиМассив <> Неопределено Тогда         
	//- ИнфоСофт Украинцева А.А. 16.11.2023 УА #65797
		Для Каждого Элемент Из ПродажиМассив Цикл
			//+ ИнфоСофт Украинцева А.А. 16.11.2023 УА #61955
			//Если Элемент.Doc_type_name = "Продажа" Тогда
			
			//+ ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97253			
			//Если Элемент.doc_type_name = "продажа" И Элемент.office_name <> "" Тогда			
			Если НРег(Элемент.doc_type_name) = "продажа" И Элемент.office_name <> "" Тогда			
			//- ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97253
			
			//- ИнфоСофт Украинцева А.А. 16.11.2023 УА #61955 			
				//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99469			
				//СтрокаТЗ = Продажи.Добавить();          
				СтрокаТЗ = ДанныеПродажи.Добавить();          
				//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99469
				СтрокаТЗ.Склад = Элемент.office_name;
				СтрокаТЗ.НаСкладе = Элемент.Quantity;
			КонецЕсли;
		КонецЦикла;
	//+ ИнфоСофт Украинцева А.А. 16.11.2023 УА #65797
	КонецЕсли;
	//- ИнфоСофт Украинцева А.А. 16.11.2023 УА #65797	
	
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99469	
	//Продажи.Свернуть("Склад", "НаСкладе");
	//ВсегоНаСкладах = Продажи.Итог("НаСкладе"); 
	//
	//Продажи.Колонки.Добавить("ПоВсемСкладам", Новый ОписаниеТипов("Число",, КвалификаторЧисла));
	//
	//Для Каждого Строка Из Продажи Цикл                                                                
	ДанныеПродажи.Свернуть("Склад", "НаСкладе");
	ВсегоНаСкладах = ДанныеПродажи.Итог("НаСкладе"); 
	
	ДанныеПродажи.Колонки.Добавить("ПоВсемСкладам", Новый ОписаниеТипов("Число",, КвалификаторЧисла));	
		
	Для Каждого Строка Из ДанныеПродажи Цикл                                                                
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99469
		Строка.ПоВсемСкладам = ВсегоНаСкладах;	
	КонецЦикла;	
	
	ВнешниеНаборыДанных = Новый Структура;
	
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99469	
	//ВнешниеНаборыДанных.Вставить("Продажи", Продажи);
	ВнешниеНаборыДанных.Вставить("Продажи", ДанныеПродажи);
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99469
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;    
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;	
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.07.23 УА #60317

#КонецОбласти
